priv/static/doc/html/elements/accordion.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Accordion Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-06 22:33:58 GMT"/>
<meta name="author" content="Roman Shestakov (@rshestakov)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Accordion Element</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Accordion Element - #accordion {} </a>
<ul>
<li><a href="#sec-1.1">1.1 Usage </a></li>
<li><a href="#sec-1.2">1.2 Attributes </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Accordion Element - #accordion {} </h2>
<div class="outline-text-2" id="text-1">


<p>
The implementation of jQuery accordion element.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="example">#accordion{
    id = accordion,
    options = [
        {event, mouseover},
        {active, 2}
    ],
    body = [
        #panel{text = "Section 1", body = [#p{ text =
            "Mauris mauris ante, blandit et, ultrices a, suscipit eget.
            Integer ut neque. Vivamus nisi metus, molestie vel, gravida in,
            condimentum sit amet, nunc. Nam a nibh. Donec suscipit eros.
            Nam mi. Proin viverra leo ut odio."}]},
        #panel{text = "Section 2", body = [#p{ text =
            "Mauris mauris ante, blandit et, ultrices a, suscipit eget.
            Integer ut neque. Vivamus nisi metus, molestie vel, gravida in,
            condimentum sit amet, nunc. Nam a nibh. Donec suscipit eros.
            Nam mi. Proin viverra leo ut odio."}]},
        #panel{text = "Section 3", body = [#p{ text =
            "Mauris mauris ante, blandit et, ultrices a, suscipit eget.
            Integer ut neque. Vivamus nisi metus, molestie vel, gravida in,
            condimentum sit amet, nunc. Nam a nibh. Donec suscipit eros.
            Nam mi. Proin viverra leo ut odio."}]},
        #panel{text = "Section 4", body = [
            #list { body=[
                #listitem { text="List Item 1" },
                #listitem { text="List Item 2" },
                #listitem { body=#checkbox { text="List Item 3" }}
            ]}
        ]}
    ],
    actions = [
        #accordion_event_on{trigger = accordion, type = ?EVENT_ACCORDION_ACTIVATE,
            postback = {Tag, {accordion, ?EVENT_ACCORDION_ACTIVATE}}},
        #accordion_event_on{trigger = accordion, type = ?EVENT_ACCORDION_BEFORE_ACTIVATE,
            postback = {Tag, {accordion, ?EVENT_ACCORDION_BEFORE_ACTIVATE}}},
        #accordion_event_on{trigger = accordion, type = ?EVENT_ACCORDION_CREATE,
            postback = {Tag, {accordion, ?EVENT_ACCORDION_CREATE}}}
    ]
}

</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>body - (<i>list of #panel{} elements</i>)</dt><dd>
Set of the panels that will be rendered within this accordion.

</dd>
<dt>options - (<i>list of tuples</i>)</dt><dd>
Options which are set during control initialization.

</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Roman Shestakov (@rshestakov)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2013-02-06 22:33:58 GMT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
